app/Controllers/Api/BookController.php

    public function list()
    {
        $book = new BookModel();

        //log_message('error', $e->getMessage());

		$response = [
			'status' => 200,
			"error" => false,
			'messages' => 'Book list',
			'data' => $book->findAll()
		];
---
SELECT *
FROM `books`

			$data['description'] = $this->request->getVar("description");
            $data['author'] = $this->request->getVar("author");

			$book->save($data);
---
INSERT INTO `books` (`isbn`, `title`, `description`, `author`) VALUES ('vdfvdv', 'dfvfdv', 'vdfvf', 'vdfvdf')